"""
this file contain all the constants of the project
alphabet of sinhala and english
paths to the frequency dict
paths to the text corpus
"""

# alphabet of given language
alphabet = {
    'en': "abcdefghijklmnopqrstuvwxyz",
    'sin': "කඛගඝඞඟචඡජඣඤටඨඩඪණතථදධනපඵබභමයරලවශෂසහළෆකාඛාගාඝාඞාඟාචාඡාජාඣාඤාටාඨාඩාඪාණාතාථාදාධානාපාඵාබාභාමායාරාලාවාශාෂාසාහාළාෆාකැඛැගැඝැඞැඟැචැඡැජැඣැඤැටැඨැඩැඪැණැතැථැදැධැනැපැඵැබැභැමැයැරැලැවැශැෂැසැහැළැෆැකෑඛෑගෑඝෑඞෑඟෑචෑඡෑජෑඣෑඤෑටෑඨෑඩෑඪෑණෑතෑථෑදෑධෑනෑපෑඵෑබෑභෑමෑයෑරෑලෑවෑශෑෂෑසෑහෑළෑෆෑකිඛිගිඝිඞිඟිචිඡිජිඣිඤිටිඨිඩිඪිණිතිථිදිධිනිපිඵිබිභිමියිරිලිවිශිෂිසිහිළිෆිකීඛීගීඝීඞීඟීචීඡීජීඣීඤීටීඨීඩීඪීණීතීථීදීධීනිපීඵීබීභීමීයීරීලීවීයීශීෂීසීහීළීෆීකුඛුගුඝුඞුඟුචුඡුජුඣුඤුටුඨුඩුඪුණුතුථุดුධුනුපුඵුබුභුමුයුරුලුවුශුෂුසුහුළුෆුකූඛූගූඝූඞූඟූචූඡූජූඣූඤූටූඨූඩූඪූණූතූථූදූධූනූපූඵූබූභූමූයූරූලූවූශූෂූසූහූළූෆූ"
}

regx = {
    'en': r'^[\W\d]+|[\W\d]+$',
    'sin': r'[^\w\u0D80-\u0DFF]+'
}